Конфигурация/Documents/ПоручениеНаДвижениеЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоручениеНаДвижениеЦенныхБумаг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоЦеннымБумагамПоПоручениям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводВсехАктивов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПередачиПоручений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерезАгента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоЦеннымБумагамПоПоручениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоЦеннымБумагамПоПоручениям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Поручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Documents/ПоручениеНаДвижениеЦенныхБумаг/Ext/ObjectModule.bsl
Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ЗадолженностиПоЦеннымБумагамПоПоручениям.Записывать = Истина;
	
	Если Не ЭтотОбъект.ВыводВсехАктивов Тогда
		// задолженность по ц/б
		Для каждого СтрокаЦенныеБумаги Из ЦенныеБумаги Цикл
			
			Движение = Движения.ЗадолженностиПоЦеннымБумагамПоПоручениям.ДобавитьПриход();
			
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Поручение                    = ЭтотОбъект.Ссылка;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.ТипЗадолженности             = ЭтотОбъект.ТипЗадолженности;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Рынок                        = ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага                 = СтрокаЦенныеБумаги.ЦеннаяБумага;
			Движение.Валюта                       = ЭтотОбъект.Валюта;
			Движение.Количество                   = СтрокаЦенныеБумаги.Количество;
			
			Если ЭтотОбъект.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская Тогда
				Движение.Сумма       = СтрокаЦенныеБумаги.Сумма;
				Движение.СуммаКупона = СтрокаЦенныеБумаги.СуммаКупона;
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если      ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, СчетДоверительногоУправления, Рынок, ДепозитарныйСчет");
		
		ЭтотОбъект.Дата 			= ДанныеЗаполнения.Дата - 6*60;
		ЭтотОбъект.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская;
		ЭтотОбъект.Валюта           = ДанныеЗаполнения.Валюта;
		
		Для каждого СтрокаЦенныеБумаги Из ДанныеЗаполнения.ЦенныеБумаги Цикл
			ЗаполнитьЗначенияСвойств(ЭтотОбъект.ЦенныеБумаги.Добавить(), СтрокаЦенныеБумаги);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыводЦенныхБумаг") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, СчетДоверительногоУправления, Рынок, ДепозитарныйСчет");
				
		ЭтотОбъект.Дата 			= ДанныеЗаполнения.Дата - 6*60;
		ЭтотОбъект.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская;
		ЭтотОбъект.Валюта           = ЭтотОбъект.Организация.ВалютаУчета;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На данный момент поручение на вывод ценных бумаг автоматически заполняется в валюте учета!");
		Для каждого СтрокаЦенныеБумаги Из ДанныеЗаполнения.ЦенныеБумаги Цикл
			ЗаполнитьЗначенияСвойств(ЭтотОбъект.ЦенныеБумаги.Добавить(), СтрокаЦенныеБумаги);
		КонецЦикла;
		
	КонецЕсли;
		
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	ЭтотОбъект.ДатаИВремяПолучения 	= "";
	
КонецПроцедуры // ПриКопировании

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВыводВсехАктивов Тогда
		
		Если ПроверяемыеРеквизиты.Найти("ДепозитарныйСчет") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДепозитарныйСчет"));
		КонецЕсли;
		
		Если ПроверяемыеРеквизиты.Найти("Рынок") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Рынок"));
		КонецЕсли;
		
		Если ПроверяемыеРеквизиты.Найти("Валюта") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Валюта"));
		КонецЕсли;
		
		Если ПроверяемыеРеквизиты.Найти("ЦенныеБумаги") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ЦенныеБумаги"));
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтотОбъект.Дата < Дата(2021, 12, 15) Тогда
		
		Если ПроверяемыеРеквизиты.Найти("ДатаИсполненияПо") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаИсполненияПо"));	
		КонецЕсли;
		
	КонецЕсли;
		
	Если ПроверяемыеРеквизиты.Найти("СпособПередачи") <> Неопределено
		И (НЕ ЭтоНовый() И НЕ ЗначениеЗаполнено(Ссылка.СпособПередачи)
			ИЛИ НЕ РаботаСДокументами.СчетДоверительногоУправленияПоЛицензииПоУправлениюЦеннымиБумагами(ЭтотОбъект.Дата, ЭтотОбъект.СчетДоверительногоУправления)) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СпособПередачи"));
	КонецЕсли;
	
	Если РаботаСДокументамиКлиентСервер.ТребуетсяПроверкаЗаполненияЗначенияКонтрагента(ЭтотОбъект) Тогда
		ПроверяемыеРеквизиты.Добавить("Контрагент");
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Если Не Отказ Тогда
			РаботаСДокументами.ВыполнитьСверкуСоСпискомНедействительныхПаспортовОтложенноПоПоручениюНаВыводАктивов(ЭтотОбъект);
		КонецЕсли;
		
		// Ценные бумаги должны быть уникальными
		Если ЭтотОбъект.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская Тогда
			УникальныеЦенныеБумаги = ЭтотОбъект.ЦенныеБумаги.Выгрузить(, "ЦеннаяБумага");
			УникальныеЦенныеБумаги.Свернуть("ЦеннаяБумага");
			Если ЭтотОбъект.ЦенныеБумаги.Количество() <> УникальныеЦенныеБумаги.Количество()  Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ценная бумага может быть выбрана в табличной части только один раз!", ЭтотОбъект.ЦенныеБумаги,,, Отказ);
				Возврат;
			КонецЕсли; 
		КонецЕсли;
		
		Если ЭтотОбъект.Дата >= Дата(2021, 12, 15) И ДатаИсполненияПо < НачалоДня(Дата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата исполнения не может быть раньше даты поручения'"), ЭтотОбъект, "ДатаИсполненияПо",, Отказ);
		КонецЕсли;
		
		Если Не Отказ Тогда
			Отказ = Не РаботаСДокументами.РазрешенВыводАктивовКонтрагенту(ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);	
	
КонецПроцедуры

#КонецОбласти
